EVENTS/CFD/SampleBuilding/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

deltaT          0.001;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


functions
{
    forces
    {
        // Monitor forces on the building
        type                forces;
        libs                ("libforces.so");
        writeControl        timeStep;
        writeInterval       1;
        patches             (building);
        rho                 rhoInf;
        log                 true;
        rhoInf              1;
        CofR                (0 0 0);
    }

    forceCoeffs
    {
        // Monitor force coefficients on the building
        type                forceCoeffs;
        libs                ("libforces.so");
        writeControl        timeStep;
        writeInterval       1;
        log                 true;
        patches             (building);
        rho                 rhoInf;
        rhoInf              1;
        liftDir             (0 1 0);
        dragDir             (1 0 0);
        CofR                (3.5 4.5 0);
        pitchAxis           (0 1 0);
        magUInf             10;
        lRef                1;
        Aref                1;
    }

    surfaceSampling
    {
        // Sample the pressure on the building
        type surfaces;

        // Where to load it from (if not already in solver)
        libs            ("libsampling.so");
        interpolationScheme cellPoint;
        writeControl    writeTime;
        surfaceFormat vtk;

        // Fields to be sampled
        fields
        (
            p
        );
        surfaces
        (
            nearWall
            {
                type            patch;
                patches         (building);
            }
        );
    }
}

// ************************************************************************* //
